## Setting up dataset for 2011 qualification data with age

In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_excel('./raw_datasets/2011_qualification_age_westminster.xlsx',sheet_name=0)

In [3]:
data.columns

Index(['Area Name', 'Area Code', 'Age Group', 'No qualifications',
       'Level 1 qualifications', 'Level 2 qualifications', 'Apprenticeship',
       'Level 3 qualifications', 'Level 4 qualifications and above',
       'Other qualifications',
       'All categories: Highest level of qualification'],
      dtype='object')

## Create a single columns for apprenticeship and Other qualifications = Others

In [4]:
data['Others'] = data.apply(lambda row: row['Apprenticeship'] + row['Other qualifications'],axis=1)

In [5]:
data.drop(columns=['Apprenticeship','Other qualifications','All categories: Highest level of qualification'],axis=1,inplace=True)

## TO:DO == Use the dataset for pivot of qualification and age

In [6]:
data.head(10)

,Area Name,Area Code,Age Group,No qualifications,Level 1 qualifications,Level 2 qualifications,Level 3 qualifications,Level 4 qualifications and above,Others
0,Berwick-upon-Tweed,E14000554,Age 25 to 34,723,1183,1611,1436,1988,395
1,Bishop Auckland,E14000569,Age 25 to 34,1208,1251,1819,1925,2447,423
2,Blaydon,E14000574,Age 25 to 34,743,1281,1833,1925,3643,445
3,Blyth Valley,E14000575,Age 25 to 34,898,1456,2109,2053,2672,406
4,City of Durham,E14000641,Age 25 to 34,905,1176,1696,1735,5362,493
5,Darlington,E14000658,Age 25 to 34,1496,1566,2176,2280,3530,708
6,Easington,E14000677,Age 25 to 34,1497,1691,2284,1911,2329,448
7,Gateshead,E14000709,Age 25 to 34,1873,1859,2299,2136,5948,915
8,Hartlepool,E14000733,Age 25 to 34,1553,1475,2178,2143,2781,525
9,Hexham,E14000746,Age 25 to 34,334,736,1128,1210,2574,317

In [7]:
data.isna().sum()

Area Name                           0
Area Code                           0
Age Group                           0
No qualifications                   0
Level 1 qualifications              0
Level 2 qualifications              0
Level 3 qualifications              0
Level 4 qualifications and above    0
Others                              0
dtype: int64

In [8]:
data.describe()

,No qualifications,Level 1 qualifications,Level 2 qualifications,Level 3 qualifications,Level 4 qualifications and above,Others
count,2292.000000,2292.000000,2292.000000,2292.000000,2292.000000,2292.000000
mean,4191.299302,2131.392670,2255.698080,1697.728621,5007.466405,1661.503927
std,3046.237069,1153.874285,967.301657,769.936840,3054.518887,777.951760
min,235.000000,247.000000,198.000000,128.000000,490.000000,211.000000
25%,1621.750000,1183.750000,1546.750000,1012.750000,3031.750000,1145.750000
50%,3435.000000,1944.000000,2196.000000,1804.000000,4357.500000,1660.000000
75%,6255.250000,2834.500000,2837.000000,2251.250000,6252.000000,2102.250000
max,16661.000000,6357.000000,5415.000000,4023.000000,26067.000000,7062.000000

## CONVERT THE DATASET IN THE FORM OF 2021 DATASET

In [9]:
df = data.copy()

In [10]:
## For loop to pivot and merge different dataframe
qualification_desciptions = df.columns[3:]
qualification_code = range(0,6)

In [11]:
qualification_desciptions

Index(['No qualifications', 'Level 1 qualifications', 'Level 2 qualifications',
       'Level 3 qualifications', 'Level 4 qualifications and above', 'Others'],
      dtype='object')

In [12]:
list(qualification_code)

[0, 1, 2, 3, 4, 5]

In [13]:
final_df = pd.DataFrame()

In [14]:
for index,description in enumerate(qualification_desciptions):
    df_pivot = df.melt(id_vars=['Area Name', 'Area Code', 'Age Group'],
                       value_vars=[description],
                       var_name='Previous Qualification Column', 
                       value_name='Observations_2011')
    
    df_pivot['Qualification_Code_Description'] = description
    df_pivot['Qualification_Code'] = qualification_code[index]
    final_df = pd.concat([final_df,df_pivot])

In [15]:
final_df.drop(columns=['Previous Qualification Column'],axis=1,inplace=True)

In [16]:
final_df.reset_index(drop=True,inplace=True)

In [17]:
final_df.head(5)

,Area Name,Area Code,Age Group,Observations_2011,Qualification_Code_Description,Qualification_Code
0,Berwick-upon-Tweed,E14000554,Age 25 to 34,723,No qualifications,0
1,Bishop Auckland,E14000569,Age 25 to 34,1208,No qualifications,0
2,Blaydon,E14000574,Age 25 to 34,743,No qualifications,0
3,Blyth Valley,E14000575,Age 25 to 34,898,No qualifications,0
4,City of Durham,E14000641,Age 25 to 34,905,No qualifications,0

In [18]:
final_df.describe()

       Observations_2011  Qualification_Code
count       13752.000000        13752.000000
mean         2824.181501            2.500000
std          2313.981056            1.707887
min           128.000000            0.000000
25%          1409.000000            1.000000
50%          2167.000000            2.500000
75%          3434.250000            4.000000
max         26067.000000            5.000000

In [21]:
final_df.groupby(['Qualification_Code_Description','Qualification_Code'])['Observations_2011'].sum()

Qualification_Code_Description    Qualification_Code
Level 1 qualifications            1                      4885152
Level 2 qualifications            2                      5170060
Level 3 qualifications            3                      3891194
Level 4 qualifications and above  4                     11477113
No qualifications                 0                      9606458
Others                            5                      3808167
Name: Observations_2011, dtype: int64

In [22]:
final_df['Qualification_Code'] = final_df['Qualification_Code'].apply(lambda val: -8 if val == 0 else (0 if val == 5 else val))

In [23]:
final_df.groupby(['Qualification_Code_Description','Qualification_Code'])['Observations_2011'].sum()

Qualification_Code_Description    Qualification_Code
Level 1 qualifications             1                     4885152
Level 2 qualifications             2                     5170060
Level 3 qualifications             3                     3891194
Level 4 qualifications and above   4                    11477113
No qualifications                 -8                     9606458
Others                             0                     3808167
Name: Observations_2011, dtype: int64

In [24]:
final_df.to_csv('./Results/2011_Westminster_Age_HighestQualification.csv',index=False)